/* 
  Localizable.strings
  RunCat

  Created by Takuto Nakamura on 2021/08/08.
  
*/

"support" = "Support Page\n";
"url" = "https://kyome.io/runcat/index.html";
"urlQueryLang" = "%@?lang=en";
"urlQueryLangHelp" = "%@?lang=en#self_made";
"urlQueryLangPlugins" = "%@?lang=en#plugins";

// Mail
"issueReport" = "Issue Report";
"environment" = "# Environment\n- %@: ver %@\n- macOS: %@\n";
"whatYouTried" = "# What You Tried\n- Relaunched the app: Yes/No\n- Restored at Runner Store: Yes/No\n";
"shortDescription" = "# Short Description\n\n";
"reproduceIssue" = "# Steps to Reproduce the Issue\n\n";
"expectedResult" = "# Expected Result\n\n";

// Main Menu
"systemInfo" = "System Info";
"runner" = "Runner";
"runnersStore" = "Runners Store…";
"preferences" = "Preferences…";
"activityMonitor" = "Open Activity Monitor";
"aboutApp" = "About RunCat";
"acknowledgments" = "Acknowledgments";
"reportIssue" = "Report an Issue";
"quitApp" = "Quit RunCat";

// System Info
"temperature" = "Temperature: %4.1f°C";

// CPU
"cpu" = "CPU: %4.1f%%";
"system" = "System: %4.1f%%";
"user" = "User: %4.1f%%";
"idle" = "Idle: %4.1f%%";

// Memory
"memory" = "Memory: %4.1f%%";
"pressure" = "Pressure: %4.1f%%";
"app" = "App: %4.1f GB";
"wired" = "Wired: %4.1f GB";
"compressed" = "Compressed: %4.1f GB";

// Battery
"batteryIsNotInstalled" = "Battery: not installed";
"battery" = "Battery: %5.1f%%";
"powerSource" = "Power Source: %@";
"health" = "Health: %5.1f%%";
"maxCapacity" = "Max Capacity: %5.1f%%";
"cycle" = "Cycle Count: %d";

// Disk
"disk" = "Disk: %4.1f%% used";

// Network
"network" = "Network: %@";
"noConnection" = "No Connection";
"localIp" = "Local IP: %@";
"upload" = "Upload: %@";
"download" = "Download: %@";
"unknown" = "Unknown";

// Self-Made
"selfMadeError" = "Self-Made Runner Error";
"fileBroken" = "This runner's data is broken. Please register again.";

// Stop Runner
"stopRunnerMessage" = "Do you really want to stop the runner?";
"stopRunnerInfo" = "If you stop the runner, the uniqueness of this application will be lost.";
"changedMyMind" = "Changed my mind";
"stop" = "Stop the runner";

// Store & IAP Notify
"storeOpenError" = "The store is currently unavailable";
"cannotPayment" = "Can't make payments.";
"someTrouble" = "Your computer may not be connected to the Internet, or the store's servers may be in trouble.";
"storeNotification" = "RunCat: Runners Store";
"finishPurchase" = "Purchase Complete";
"funTime" = "Have a fun time!";
"finishRestore" = "Restore Complete";
"checkState" = "Check your store state.";
"failedRestore" = "Your Restore Could Not Be Completed";
"failedPurchase" = "Your Purchase Could Not Be Completed";
"neverPurchase" = "You should purchase at least one item in advance.";
"contactText" = "For assistance, contact App Store Support at https://support.apple.com/apps/.";

// Store Item
"allRunnerDescription" = "Special color runners are not included.";
"colorDescription" = "Special color runner: Support the developer.";
"unlockedDescription" = "Unlocked runner registration.";
"purchase" = "Purchase";
"purchased" = "Purchased";
"restore" = "Restore based on history";
"do" = "Do it";

// Registration
"addImage" = "Select PNG files.";
"registrationError" = "Runner Registration Error";
"addImage" = "Your uploaded file FILE_NAME violates the regulations.";
"over100" = "You can't upload over 100 images.";
"nameConflict" = "This name has already used. Please use another one.";
"registerFailed" = "Registration Failed.";
"loadingImageError" = "Image Loading Error";
"onlyPNG" = "The only file format you can use is png.";
"lockSelfMadeError" = "Registration Function Is Locked";
"mustBuy" = "Please purchase the Self-Made Runner at the runner store.";

// Bug Support
"recommendMessage" = "The setting to stop the runner is currently enabled.";
"recommendInfo" = "If this is not your intention, please disable the setting to stop the runner in the preferences. I apologize for any inconvenience this may cause.";

// Runner Name
"cat"            = "Cat α";
"b.cat"          = "Cat β";
"c.cat"          = "Cat γ";
"tail.cat"       = "Cat Tail";
"cat.nyan.mock"  = "Mock Nyan Cat";
"parrot"         = "Parrot";
"human"          = "Human";
"up.push"        = "Push-Up";
"up.sit"         = "Sit-Up";
"duck.rubber"    = "Rubber Duck";
"city"           = "City";
"sausage"        = "Sausage";
"dots"           = "Dots";
"reactor"        = "Reactor";
"slime"          = "Slime";
"fishman"        = "Fish-Man";
"sheep"          = "Sheep";
"sushi.rotating" = "Rotating Sushi";
"people.party"   = "Party People";
"dogeza"         = "Japanese Apology";
    
"cheetah"       = "Cheetah";
"dog"           = "Dog";
"puppy"         = "Puppy";
"rabbit"        = "Rabbit";
"frog"          = "Frog";
"bird"          = "Bird";
"penguin"       = "Penguin";
"dolphin"       = "Dolphin";
"dragon"        = "Dragon";
"owl"           = "Owl";
"dinosaur"      = "Dinosaur";
"terrier"       = "Terrier";
"hedgehog"      = "Hedgehog";
"horse"         = "Horse";
"penguin2"      = "Penguin 2";
"wheel.hamster" = "Hamster Wheel";
"octopus"       = "Octopus";
"chameleon"     = "Chameleon";
"chicken"       = "Chicken";
"mouse"         = "Mouse";
"pig"           = "Pig";
"fox"           = "Fox";
"whale"         = "Whale";
"otter"         = "Otter";
"squirrel"      = "Squirrel";
"butterfly"     = "Butterfly";
"greyhound"     = "Greyhound";
"corgi.welsh"   = "Welsh Corgi";
    
"cogwheel"         = "Cogwheel";
"bonfire"          = "Bonfire";
"drop"             = "Drop";
"rocket"           = "Rocket";
"pendulum"         = "Pendulum";
"cradle"           = "Newton's Cradle";
"curve.sine"       = "Sine Curve";
"pulse"            = "Pulse";
"coffee"           = "Coffee";
"locomotive.steam" = "Steam Locomotive";
"drink.tapioca"    = "Tapioca Drink";
"frypan"           = "Frypan";
"factory"          = "Factory";
"engine"           = "Engine";
"earth"            = "Earth";

"sleigh.reindeer"   = "Reindeer & Sleigh";
"snowman"           = "Snowman";
"chime.wind"        = "Wind Chime";
"sparkler"          = "Sparkler";
"lantern.o.jack"    = "Jack O' Lantern";
"ghost"             = "Ghost";
"mochi"             = "Mochi";

"runners.all"       = "Unlock All Runners";
"cat.golden"        = "Golden Cat";
"cat.cluster.metal" = "Metal Cluster Cat";
"cat.flash"         = "Flash Cat";
"neko.maneki"       = "Maneki Neko";
"sushi"             = "Sushi";
"cat.gaming"        = "Gaming Cat";
"parrot.party"      = "Party Parrot";
"uhooi"             = "Uhooi";
"made.self"         = "Self-Made Runner";
